---
type: Asset
namespace: Autodesk.Revit.DB.Visual
version: 2024
members: 3
tags: [revit-api, class]
---

# Asset

`Autodesk.Revit.DB.Visual.Asset` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | AssetType | — | `public AssetType AssetType { get ; }` |
| Property | LibraryName | — | `public string LibraryName { get ; }` |
| Property | Title | — | `public string Title { get ; }` |